<script setup lang="ts">
const faqs = [
  {
    id: 1,
    title: "Какие способы оплаты у вас есть?",
    text: "Возврат товара осуществляет с предоставлением доказательств о непригодности или не соответствии товара с отправленным. Отправка товара обратно, оплачивается самим клиентом",
  },
  {
    id: 2,
    title: "Как осуществляется возврат товара?",
    text: "Возврат товара осуществляет с предоставлением доказательств о непригодности или не соответствии товара с отправленным. Отправка товара обратно, оплачивается самим клиентом",
  },
  {
    id: 3,
    title: "Какие гарантии?",
    text: "Возврат товара осуществляет с предоставлением доказательств о непригодности или не соответствии товара с отправленным. Отправка товара обратно, оплачивается самим клиентом",
  },
  {
    id: 4,
    title: "Какие гарантии?",
    text: "Возврат товара осуществляет с предоставлением доказательств о непригодности или не соответствии товара с отправленным. Отправка товара обратно, оплачивается самим клиентом",
  },
  {
    id: 5,
    title: "Какие гарантии?",
    text: "Возврат товара осуществляет с предоставлением доказательств о непригодности или не соответствии товара с отправленным. Отправка товара обратно, оплачивается самим клиентом",
  },
  {
    id: 6,
    title: "Какие способы оплаты у вас есть?",
    text: "Возврат товара осуществляет с предоставлением доказательств о непригодности или не соответствии товара с отправленным. Отправка товара обратно, оплачивается самим клиентом",
  },
];
</script>

<template>
  <section class="faq">
    <div class="faq__content container">
      <h2 class="h2 faq__title">Ответы на часто задаваемые вопросы</h2>
      <div class="faq__questions">
        <AccordionBase v-for="faq in faqs" :key="faq.id" :accordion="faq" />
      </div>
    </div>
  </section>
</template>

<style lang="scss" scoped>
.faq {
  &__title {
    text-align: center;
  }

  &__content {
    max-width: 1072px;
  }

  &__questions {
    margin-top: 45px;
    display: grid;
    gap: 30px;
  }
}
</style>
